const chinaData = [
    {
        "adcode": "360000",
        "people_count_2010": 43976312,
        "lat": 28.676493,
        "lng": 115.892151,
        "name": "江西省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />中央民族歌舞团2022年民族新年音乐会--江西艺术中心音乐厅<br />中央民族歌舞团2022年民族新年音乐会--江西艺术中心音乐厅<br \>《直到世界尽头》二次元经典动漫视听音乐会--江西艺术中心音乐厅<br \>2021赣州大剧院首届“辞旧迎新——新春演出季” 《唤醒经典 超越炫技》钢琴家胡雪莎钢琴独奏音乐会--赣州大剧院"
    },
    {
        "adcode": "410000",
        "people_count_2010": 96486884,
        "lat": 34.757975,
        "lng": 113.665412,
        "name": "河南省",
        "level": "province",
        "parent": "中华人民共和国" ,
        "str":"<br />东风日产天籁2022新年音乐会-中国歌剧舞剧院交响乐团--郑州大剧院·音乐厅<br />【郑州站】菊次郎的夏天--久石让钢琴曲梦幻之旅演奏会 （剧场服务）--河南艺术中心音乐厅<br\>MPK︱平安奇妙夜 - 塑料人&公园野餐乐队演出 圣诞摇滚音乐会--MPK音乐公共王国"
    },
    {
        "adcode": "510000",
        "people_count_2010": 85974759,
        "lat": 30.659462,
        "lng": 104.065735,
        "name": "四川省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />「明日争取」全国巡演-成都站--成都CH8冇独空间·完美店<br />第27届“蓉城之秋”成都国际音乐季 “星光灿烂”——成都爵士乐团专场音乐会--成都城市音乐厅·戏剧厅<br \>（租场）2022天籁新年音乐会-亚洲爱乐乐团 重庆（大剧场）--重庆大剧院"
    },
    {
        "adcode": "500000",
        "people_count_2010": 28458101,
        "lat": 29.533155,
        "lng": 106.504962,
        "name": "重庆市",
        "level": "province",
        "parent": "中华人民共和国",
        "str":""
    },
    {
        "adcode": "540000",
        "people_count_2010": 2554907,
        "lat": 29.660361,
        "lng": 91.132212,
        "name": "西藏自治区",
        "level": "province",
        "parent": "中华人民共和国",
        "str":""
    },
    {
        "adcode": "520000",
        "people_count_2010": 25119376,
        "lat": 26.578343,
        "lng": 106.713478,
        "name": "贵州省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />2022年遵义新年民族交响音乐会—中央民族歌舞团民乐团--遵义市大剧院歌剧厅<br />"
    },
    {
        "adcode": "210000",
        "people_count_2010": 43149614,
        "lat": 41.796767,
        "lng": 123.429096,
        "name": "辽宁省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />《听音乐，看世界》 ——2022年大连跨年音乐会-大连站--大连国际会议中心大剧院<br />《交响童话圣诞音乐会——大型视听交响音乐会》--盛京大剧院-音乐厅<br \>《“推开世界的门”，星河九歌2022年新年合唱音乐会》--盛京大剧院-音乐厅<br \>中国东方演艺集团交响乐团新年音乐会--盛京大剧院-音乐厅<br \>2022新年音乐会-鞍山站--鞍山大剧院<br \>国乐新韵独奏重奏新年民族音乐会-大连站--大连国际会议中心大剧院"
    },
    {
        "adcode": "650000",
        "people_count_2010": 29070614,
        "lat": 43.792818,
        "lng": 87.617733,
        "name": "新疆维吾尔自治区",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />一生必听钢琴名曲——贝多芬四大奏鸣曲谭小棠独奏音乐会--乌鲁木齐剧院<br />"
    },
    {
        "adcode": "370000",
        "people_count_2010": 94646230,
        "lat": 36.675807,
        "lng": 117.000923,
        "name": "山东省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />青岛交响乐团2021-2022音乐季-来自肖邦故乡的问候--青岛人民会堂<br />维也纳约翰施特劳斯之夜·2022新年音乐会--青岛人民会堂<br \>东风日产天籁2022新年音乐会-中国歌剧舞剧院交响乐团--山东省会大剧院音乐厅"
    },
    {
        "adcode": "310000",
        "people_count_2010": 21135161,
        "lat": 31.231706,
        "lng": 121.472644,
        "name": "上海市",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />超燃音乐系-神秘园.雅尼.班得瑞-新世纪经典作品音乐会--东方艺术中心-音乐厅<br \>X玖少年团 赵磊「第一次」巡演上海站--上海保利大剧院-大剧场<br \>音乐剧《阿加莎》中文版--中国大戏院<br \>音乐剧《阿加莎》中文版--中国大戏院<br \>第25小时跨年演唱会-千禧年起历年金曲串烧&跨年倒计时--THE BOXX城市乐园<br \>【线上直播】动感地带·第十五届音乐盛典咪咕汇--五月天、周杰伦、薛之谦、小鬼、李宇春、邓紫棋、周深、欧阳娜娜、黑豹乐队、许嵩、SUNNEE<br \>染空间中文原创音乐剧《白夜行》--上汽上海文化广场"
    },
    {
        "adcode": "820000",
        "people_count_2010": null,
        "lat": 22.198951,
        "lng": 113.54909,
        "name": "澳門特別行政區",
        "level": "province",
        "parent": "中华人民共和国",
        "str":""
    },
    {
        "adcode": "140000",
        "people_count_2010": 34364492,
        "lat": 37.857014,
        "lng": 112.549248,
        "name": "山西省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />“你好！2022”零点跨年交响嘉年华（合作）--山西大剧院音乐厅<br />爱乐之城-奥斯卡经典电影视听圣诞音乐会--山西大剧院音乐厅<br \>天空之城-久石让宫崎骏经典动漫视听音乐会（剧场服务）--山西大剧院音乐厅"
    },
    {
        "adcode": "330000",
        "people_count_2010": 53807755,
        "lat": 30.287459,
        "lng": 120.153576,
        "name": "浙江省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />2022郎朗杭州艺术世界新年音乐会--杭州大剧院(音乐厅)<br />大船文化·中国电影乐团·2022新年交响音乐会--浙江省人民大会堂<br \>《灌篮高手——直到世界的尽头》经典动漫主题视听音乐会—温州站--温州大剧院"
    },
    {
        "adcode": "460000",
        "people_count_2010": 42028870,
        "lat": 20.031971,
        "lng": 110.33119,
        "name": "海南省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />三亚海岛音乐季 跨年·迷笛之夜--崔健、二手玫瑰、齐秦、逃跑计划、吴克群、面孔乐队<br \>2021万宁·神州半岛TIDE音乐节--C-BLOCK、乃万、张思源、DP龙猪、Tizzy T、唐伟/威尔Will.T、GAI、布瑞吉<br \>NAIR BAND全国巡演 · 2022海口新年音乐会--海口湾演艺中心<br \>杭盖2021乘风而归保利剧院院线巡演--海口湾演艺中心"
    },
    {
        "adcode": "350000",
        "people_count_2010": 39026582,
        "lat": 26.075302,
        "lng": 119.306239,
        "name": "福建省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />《魔法钢琴与肖邦短篇》多媒体动画音乐会--福建大剧院音乐厅<br />summer-宫崎骏?久石让经典动漫视听音乐会-福州--福建会堂<br \>从Butter-Fly到夏目の愛してる—— 经典动漫主题曲浪漫钢琴演奏会--厦门宏泰音乐厅"
    },
    {
        "adcode": "630000",
        "people_count_2010": 5619543,
        "lat": 36.623178,
        "lng": 101.778916,
        "name": "青海省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />《2022 青海大剧院 新年音乐会》--青海大剧院-大剧场<br />"
    },
    {
        "adcode": "640000",
        "people_count_2010": 6466366,
        "lat": 38.46637,
        "lng": 106.278179,
        "name": "宁夏回族自治区",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />安德烈·伊万诺维奇钢琴音乐会--宁夏人民剧院大剧场<br />"
    },
    {
        "adcode": "420000",
        "people_count_2010": 62160766,
        "lat": 30.584355,
        "lng": 114.298572,
        "name": "湖北省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />12月25日 武汉「星巢现场·冬泳派对」房东的猫+霓虹花园+散人乐队+汉堡黄--不晚IN TIME LIVE<br />武汉爱乐乐团2022年新年音乐会—久石让的音乐世界（Z）--武汉琴台音乐厅<br \>2022新年音乐会香港亚洲爱乐乐团--湖北剧院<br \>权力的游戏—Charming Live·燃系史诗交响视听音乐会（Z）--武汉琴台音乐厅<br \>新年视听互动音乐会《千与千寻》--琴台大剧院多功能厅"
    },
    {
        "adcode": "620000",
        "people_count_2010": 27957557,
        "lat": 36.058039,
        "lng": 103.823557,
        "name": "甘肃省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />德米特里·马斯列耶夫钢琴独奏音乐会--甘肃大剧院大剧场<br />"
    },
    {
        "adcode": "340000",
        "people_count_2010": 57217014,
        "lat": 31.86119,
        "lng": 117.283042,
        "name": "安徽省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />阜阳春之声?宫崎骏久石让动漫音乐会--阜阳大剧院-大剧场<br />【租场代理】“偶裕”——2021沈文裕钢琴独奏音乐会全国巡演合肥站--合肥大剧院音乐厅<br \>《千与千寻》宫崎骏&久石让视听音乐故事会(合作项目)--马鞍山大剧院<br \>东风日产天籁 2022新年音乐会--合肥大剧院音乐厅"
    },
    {
        "adcode": "710000",
        "people_count_2010": null,
        "lat": 25.044332,
        "lng": 121.509062,
        "name": "台湾省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":""
    },
    {
        "adcode": "610000",
        "people_count_2010": 35876998,
        "lat": 34.263161,
        "lng": 108.948024,
        "name": "陕西省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />2022.1.24【第20届西安国际音乐节】吕思清小提琴独奏音乐会--西安音乐厅-交响大厅<br />2022.01.14【第20届西安国际音乐节】琴为何物——自得琴社音乐会--陕西大剧院-歌剧厅"
    },
    {
        "adcode": "450000",
        "people_count_2010": 47082115,
        "lat": 22.82402,
        "lng": 108.320004,
        "name": "广西壮族自治区",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />【套票特惠】李宗盛作品音乐剧《当爱已成往事》--广西文化艺术中心(保利)大剧院<br />【早鸟特惠】内蒙古艺术剧院民族曲艺团《奈热乐队专场音乐会》--南宁剧场<br \>《激情与律动——爵士现代风格音乐会》--广西文化艺术中心音乐厅"
    },
    {
        "adcode": "120000",
        "people_count_2010": 15298136,
        "lat": 39.125596,
        "lng": 117.190182,
        "name": "天津市",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />开心麻花爆笑舞台剧《李茶的姑妈》--民园剧场<br \>世界名曲音乐会——平安夜专场--津湾大剧院小剧场<br \>《维也纳约翰·施特劳斯之夜》经典作品交响新年音乐会--天津大剧院音乐厅<br \>“爱乐之城”——经典电影音乐作品新年音乐会--天津大剧院音乐厅<br \>亚洲爱乐乐团2022天津城市新年音乐会--天津大礼堂大剧场<br \>冬季奇遇企划音乐会--智慧山·琉璃剧场"
    },
    {
        "adcode": "530000",
        "people_count_2010": 72840959,
        "lat": 25.040609,
        "lng": 102.712251,
        "name": "云南省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />“星耀华彩 乐动新年” 星光室内乐团2022年新春音乐会--云南艺术剧院<br />难忘的旋律--难忘的旋律<br \>悦音绕梁——老宅新年音乐会--马家大院"
    },
    {
        "adcode": "230000",
        "people_count_2010": 40734477,
        "lat": 45.756967,
        "lng": 126.642464,
        "name": "黑龙江省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />梦见卡带-华语流行经典音乐会--哈尔滨大剧院歌剧厅<br />"
    },
    {
        "adcode": "440000",
        "people_count_2010": 107131199,
        "lat": 23.125178,
        "lng": 113.280637,
        "name": "广东省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />天籁2022新年音乐会-中央民族乐团《天地永乐·中国节》--深圳保利剧院<br \>【影院Live.全新体验】CINESKY新天之夜·世界经典名曲2022新年音乐会--CINESKY新天影院IMAX-C区<br \>“百老汇”经典音乐剧&世界经典名曲交响音乐会--星海音乐厅(交响乐演奏厅)<br \>【深圳】《卡农Canon In D》永恒经典名曲精选新年音乐会--南山文体中心剧院大剧院<br \>2022广州大剧院新年音乐会 民族史诗 音乐丰碑 交响合唱《黄河大合唱》--广州大剧院歌剧厅<br \>【深圳】“爱乐之城”---经典电影音乐作品新年音乐会--南山文体中心剧院大剧院<br \>平安夜”猫和老鼠“古典名曲视听音乐会--广州正佳大剧院"
    },
    {
        "adcode": "430000",
        "people_count_2010": 67158313,
        "lat": 28.19409,
        "lng": 112.982279,
        "name": "湖南省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />【自营】《飞狗》崔健巡演—长沙站--长沙梅溪湖国际文化艺术中心大剧院<br />2022跨年新年音乐会?《春之声圆舞曲》--长沙303阳光剧场<br \>2021长沙第三届跨年音乐会--长沙音乐厅<br \>吴彤《国乐正当燃》汉服民乐会--湖南省文化馆音乐厅"

    },
    {
        "adcode": "130000",
        "people_count_2010": 106816280,
        "lat": 38.045474,
        "lng": 114.502461,
        "name": "河北省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":""
    },
    {
        "adcode": "150000",
        "people_count_2010": 26353789,
        "lat": 40.818311,
        "lng": 111.670801,
        "name": "内蒙古自治区",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />【合作】《天空之城》视听互动音乐会-宫崎骏遇到久石让三十年--乌兰恰特大剧院<br />【鄂尔多斯站·预售】飞狗2022崔健保利院线巡演--鄂尔多斯大剧院<br \。【鄂尔多斯站】《千与千寻》久石让·宫崎骏动漫作品视听交响音乐会--鄂尔多斯大剧院"
    },
    {
        "adcode": "220000",
        "people_count_2010": 26423220,
        "lat": 43.886841,
        "lng": 125.3245,
        "name": "吉林省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />奏响新春交响音乐会长春国际会议中心主会场<br />“偶裕”—2022沈文裕钢琴音乐会长春站--长春国际会议中心主会场"
    },
    {
        "adcode": "320000",
        "people_count_2010": 79104628,
        "lat": 32.041544,
        "lng": 118.767413,
        "name": "江苏省",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />XMas Time Again 2021：Kc左元杰 G.G张思源 Kandi侃迪 Buzzy OWEN欧阳子文--南京-稻香音乐空间<br \>国际首席爱乐乐团新年音乐会--苏州文化艺术中心-大剧院<br \>江苏大剧院2022新年音乐会——世界之舞·王之炅与时代重奏团跨年音乐会--江苏大剧院--音乐厅<br \>2022南京新年音乐会--南京人民大会堂<br \>2022听见国潮新年音乐会--苏州独墅湖影剧院<br \>【万有音乐系】中国歌剧舞剧院新年音乐会--苏州聚橙尹山湖大剧院"
    },
    {
        "adcode": "110000",
        "people_count_2010": 18934592,
        "lat": 39.904989,
        "lng": 116.405285,
        "name": "北京市",
        "level": "province",
        "parent": "中华人民共和国",
        "str":"<br />叶锦添导演 万茜、宋洋主演舞台剧《倾城之恋》--国家大剧院-歌剧院<br \>李宗盛作品音乐剧《当爱已成往事》--保利剧院<br \>中国国家话剧院演出 话剧《四世同堂》--国家大剧院-歌剧院<br \>NewBlood圣诞狂欢电音节 · 北京站--北京HEAVEN CLUB (天堂工体店)<br \>2022跨年倒计时蜜糖演唱会＆粉红派对 甜蜜暴击！终极浪漫拯救世界！--糖果TANGO-雍和宫店三层<br \>开心麻花深情暖心音乐剧《了不起的悲伤》--北京9剧场-切CHE·行动剧场"
    },
    {
        "adcode": "810000",
        "people_count_2010": null,
        "lat": 22.320048,
        "lng": 114.173355,
        "name": "香港特別行政區",
        "level": "province",
        "parent": "中华人民共和国",
        "str":""
    }
];